src/Documents/ЗаменыОрганизаций/ЗаменыОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаменыОрганизаций</name>
  <comment>(Регл)</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаСотрудник</name>
    <comment>Сотрудник, которого заменяют</comment>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаДолжность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаменаГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <comment>Либо Замещение, либо Совмещение</comment>
    <type>
      <types>ChartOfCalculationTypesRef.ОсновныеНачисленияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
</mdclass:Document>

src/InformationRegisters/РаботникиОрганизаций/РаботникиОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботникиОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ЗаменыОрганизаций/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

Функция ПолучитьГрафикПоРаботнику(мСотрудник, мДатаНачала) Экспорт
	
	СтруктураДанныхОРаботнике = Новый Структура("ПодразделениеОрганизации,ГрафикРаботы,Должность");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачалаСобытия",	мДатаНачала );
	Запрос.УстановитьПараметр("парамСотрудник",		мСотрудник );
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	АктуальныйГрафик.ПодразделениеОрганизации,   
	|	АктуальныйГрафик.ГрафикРаботы,   
	|	АктуальныйГрафик.Должность   
	|ИЗ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&ДатаНачалаСобытия, Сотрудник = &парамСотрудник) КАК АктуальныйГрафик
	|
	|";
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтруктураДанныхОРаботнике.ПодразделениеОрганизации	= Выборка.ПодразделениеОрганизации;
		СтруктураДанныхОРаботнике.ГрафикРаботы				= Выборка.ГрафикРаботы;
		СтруктураДанныхОРаботнике.Должность					= Выборка.Должность;
	КонецЕсли;
	
	Возврат	СтруктураДанныхОРаботнике;

КонецФункции // ПолучитьГрафикПоРаботнику()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

Функция СформироватьЗапросПоШапке()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	Основной.Дата					КАК Дата,
	|	Основной.Организация,
	|	Основной.Ссылка,
	|
	|	Основной.Сотрудник,
	|	Основной.ЗаменаСотрудник,
	|	Основной.ЗаменаПодразделениеОрганизации,
	|	Основной.ЗаменаГрафикРаботы,
	|	Основной.ЗаменаДолжность,
	|	Основной.ВидРасчета,
	|	Основной.ДатаНачала,
	|	Основной.ДатаОкончания
	|
	|   ИЗ Документ."+Ссылка.Метаданные().Имя+" КАК Основной
	|  ГДЕ  Основной.ссылка = &ДокументСсылка
	|";
	
	Запрос.Текст = ТекстЗапроса;

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()


Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ) Экспорт

	//  Организация
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Организация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, по которой выполняется замена!", Отказ);
	КонецЕсли;

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник, который должен заменять!", Отказ);
	КонецЕсли;
 
	// ЗаменаСотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаСотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбран сотрудник, которого должны заменять!", Отказ);
	КонецЕсли;

	// ДатаНачала
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаНачала) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата начала замены!", Отказ);
	КонецЕсли;
	
	// ДатаОкончания
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ДатаОкончания) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана дата окончания замены!", Отказ);
	КонецЕсли;
	
	// ВидРасчета
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ВидРасчета) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан вид замены!", Отказ);
	КонецЕсли;
	
	// ЗаменаГрафикРаботы
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаГрафикРаботы) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан график работы, по которому будет производится замена!", Отказ);
	КонецЕсли;
	
	// ЗаменаПодразделениеОрганизации
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаПодразделениеОрганизации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано подразделение, где будет работать сотрудник!", Отказ);
	КонецЕсли;
	
	// ЗаменаДолжность
	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ЗаменаДолжность) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана должность на которой будет работать сотрудник!", Отказ);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеШапки()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке();

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();
	ВыборкаПоШапкеДокумента.Следующий();
	
	//Надо позвать проверку заполнения реквизитов шапки
	ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПроцедурыУправленияПерсоналом.ЗаполнитьФизЛицо(ЭтотОбъект);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИНИЦИАЛИЗАЦИЯ ОБЪЕКТА
